Repository: jaimerc01/diseases_app
Catalog: lib/l10n/app_*.arb
Languages: gl

# titulo_registro
source: Create your personal account
gl: Cree a súa conta persoal

# titulo_inicio_sesion
source: Log in your account
gl: Inicie sesión na súa conta

# titulo_inicio
source: Welcome back
gl: Benvido de novo

# titulo_clasificador
source: Disease classifier
gl: Clasificador de enfermidades dixestivas

# boton_registrarse
source: SIGN UP
gl: REXISTRARSE

# boton_iniciar_sesion
source: LOG IN
gl: INICIAR SESIÓN

# boton_galeria
source: OPEN GALLERY
gl: ABRIR GALERÍA

# boton_actualizar
source: UPDATE DATA
gl: ACTUALIZAR DATOS

# boton_confirmar
source: CONFIRM
gl: CONFIRMAR

# boton_cancelar
source: CANCEL
gl: CANCELAR

# boton_actualizar2
source: UPDATE
gl: ACTUALIZAR

# boton_modificar_contrasena
source: CHANGE PASSWORD
gl: MODIFICAR CONTRASINAL

# boton_desasignar
source: UNASSIGN
gl: DESASIGNAR

# boton_asignar_paciente
source: ASSIGN PATIENT
gl: ASIGNAR PACIENTE

# boton_anadir_medico
source: ADD DOCTOR
gl: ENGADIR MÉDICO

# correo_electronico
source: Email
gl: Correo electrónico

# nombre
source: Full name
gl: Nome completo

# contrasena
source: Password
gl: Contrasinal

# confirmar_contrasena
source: Confirm password
gl: Confirmar contrasinal

# contrasena_actual
source: Current password
gl: Contrasinal actual

# nueva_contrasena
source: New password
gl: Novo contrasinal

# confirmar_nueva_contrasena
source: Confirm new password
gl: Confirmar novo contrasinal

# dni_paciente
source: Patient's DNI/NIE
gl: DNI/NIE do paciente

# numero_colegiado
source: Collegiate number
gl: Número de colexiado

# pregunta_inicio_sesion
source: Don't have an account?
gl: Non tes conta?

# pregunta_registro
source: Already have an account?
gl: Xa ten conta?

# iniciar_sesion
source: Log in
gl: Iniciar sesión

# registrarse
source: Sign up
gl: Rexistrarse

# registro_ok
source: Signed up successfully
gl: Rexistrado correctamente

# introduzca_dni
source: Enter your DNI/NIE
gl: Introduza o seu DNI/NIE

# introduzca_correo
source: Enter your email
gl: Introduza o seu correo electrónico

# introduzca_nombre
source: Enter your full name
gl: Introduza o seu nome completo

# introduzca_contrasena
source: Enter your password
gl: Introduza o seu contrasinal

# introduzca_actual_contrasena
source: Enter your current password
gl: Introduza o actual contrasinal

# introduzca_dni_paciente
source: Enter the patient's DNI/NIE
gl: Introduza o DNI/NIE do paciente

# introduzca_numero_colegiado
source: Enter your collegiate number
gl: Introduza o seu número de colexiado

# drawer_inicio
source: Dashboard
gl: Inicio

# drawer_clasificador
source: Classifier
gl: Clasificador

# drawer_historial
source: History
gl: Rexistro

# drawer_doctores
source: Check doctors
gl: Consultar doutores

# drawer_pacientes
source: Check patients
gl: Consultar paceentes

# drawer_perfil
source: Profile
gl: Perfil

# drawer_cerrar_sesion
source: Log out
gl: Pechar sesión

# precision
source: Accuracy
gl: Precisión

# seleccione_foto
source: Pick a photo
gl: Escolla unha foto

# cambiar_contrasena
source: Change password
gl: Cambiar contrasinal

# confirmar_borrado
source: Confirm account deletion
gl: Confirmar a eliminación da conta

# pregunta_borrado
source: Are you sure you want to permanently delete your account?
gl: Está seguro de que desexa eliminar permanentemente a súa conta?

# borrado_ok
source: Account deleted successfully
gl: Conta eliminada correctamente

# borrar_cuenta
source: Delete account
gl: Eliminar conta

# actualizado_ok
source: Updated successfully
gl: Datos actualizados correctamente

# confirmar_borrado_elemento
source: Confirm deletion
gl: Confirmar eliminación

# borrado_elemento_ok
source: Item deleted successfully
gl: Elemento eliminado correctamente

# pregunta_borrado_elemento
source: Are you sure you want to permanently delete this item?
gl: Está seguro de que desexa eliminar este resultado do rexistro permanentemente?

# contrasena_ok
source: Password changed successfully
gl: Contrasinal cambiado correctamente

# desasignar_pacientes
source: Unassign patient
gl: Desasignar paciente

# pregunta_desasignar_pacientes
source: Are you sure you want to unassign this patient?
gl: Está seguro de que desexa desasignar este paciente?

# paciente_desasignado
source: Patient unassigned
gl: Paciente desasignado

# mostrar_historial
source: Show history
gl: Mostrar rexistro

# presione_paciente
source: Press to assign a patient
gl: Preme para asignar un paciente

# asignado_ok
source: Patient assigned successfully
gl: Paciente asignado correctamente

# no_hay_pacientes
source: There are no patients assigned
gl: Non hai pacientes asginados

# presione_medico
source: Press to add a doctor
gl: Preme para engadir un doutor

# doctor_borrado_ok
source: Doctor deleted successfully
gl: Doutor eliminado correctamente

# pregunta_borrado_doctor
source: Are you sure you want to permanently delete this doctor account?
gl: Está seguro de que desexa eliminar permanentemente a conta deste doutor?

# confirmar_borrado_doctor
source: Confirm doctor deletion
gl: Confirmar eliminación de doutor

# no_hay_medicos
source: There are no doctors registered
gl: Non hai doutores rexistrados

# correctamente_dni
source: Enter your DNI/NIE correctly
gl: Introduza correctamente o seu DNI/NIE

# ya_registrado
source: Your DNI/NIE is already registered
gl: O seu DNI/NIE xa está rexistrado

# no_registrado
source: Your DNI/NIE isn't registered
gl: O seu DNI/NIE non está rexistrado

# no_valido_correo
source: Invalid email
gl: Correo electrónico non válido

# tamano_dni
source: The size does not match that of a DNI/NIE
gl: O tamaño non coincide co dun DNI/NIE

# tamano_contrasena
source: Password must be at least 8 characters
gl: O contrasinal debe ter polo menos 8 caracteres

# no_coincide_contrasena
source: Password does not match
gl: O contrasinal non coincide

# incorrecta_contrasena
source: Wrong password
gl: Contrasinal incorrecto

# no_reconocido
source: Not found
gl: Non foi recoñecido

# correctamente_dni_paciente
source: Enter the patient's DNI/NIE correctly
gl: Introduza correctamente o DNI/NIE do paciente

# no_registrado_dni_paciente
source: The patient's DNI/NIE is not registered
gl: O DNI/NIE do paciente non está rexistrado

# paciente_ya_asignado
source: The patient already has a doctor assigned
gl: O paciente xa ten un doutor asignado

# tamano_numero_colegiado
source: The size does not match that of a collegiate number
gl: O tamaño non coincide co dun número de colexiado

# ya_registrado_numero_colegiado
source: Your collegiate number is already registered
gl: O seu número de colexiado xa está rexistrado
